In [13]:
import pandas as pd 
import numpy as np 
import os

from utils import * 

df_2012_summer = pd.DataFrame(pd.read_csv(os.path.join("/kaggle", Y_2012, "summer.csv")))
df_2012_winter = pd.DataFrame(pd.read_csv(os.path.join("/kaggle", Y_2012, "winter.csv")))
df_2012 = pd.concat([df_2012_summer, df_2012_winter])
df_2012 = df_2012.drop('Athlete', axis=1)
df_2016 = pd.DataFrame(pd.read_csv(os.path.join("/kaggle", Y_2016, "athletes.csv")))
df_2020 = pd.DataFrame(pd.read_csv(os.path.join("/kaggle", Y_2020, "medals_total.csv")))

# print(f'df_2012:\n{df_2012.head()} \n df_2016:\n{df_2016.head()} \n df_2020:\n{df_2020.head()}')

In [7]:
df_2012.head()

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [8]:
df_2016.head()

,id,name,nationality,sex,dob,height,weight,sport,gold,silver,bronze
0,736041664,A Jesus Garcia,ESP,male,10/17/69,1.72,64.0,athletics,0,0,0
1,532037425,A Lam Shin,KOR,female,9/23/86,1.68,56.0,fencing,0,0,0
2,435962603,Aaron Brown,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1
3,521041435,Aaron Cook,MDA,male,1/2/91,1.83,80.0,taekwondo,0,0,0
4,33922579,Aaron Gate,NZL,male,11/26/90,1.81,71.0,cycling,0,0,0

In [14]:
df_2020

,Rank,Country Code,Gold Medal,Silver Medal,Bronze Medal,Total,Country
0,1,USA,39,41,33,113,United States of America
1,2,CHN,38,32,18,88,People's Republic of China
2,3,JPN,27,14,17,58,Japan
3,4,GBR,22,21,22,65,Great Britain
4,5,ROC,20,28,23,71,ROC
...,...,...,...,...,...,...,...
88,89,GHA,0,0,1,1,Ghana
89,90,GRN,0,0,1,1,Grenada
90,91,KUW,0,0,1,1,Kuwait
91,92,MDA,0,0,1,1,Republic of Moldova
92,93,SYR,0,0,1,1,Syrian Arab Republic